# Общая сложность программы - #O(n)
def nice_stones_bro(jewels,stones):  # создаем функцию
    a = list(jewels)  # с помощью цикла будем проходить по элементам и сравнивать
    b = list(stones)  # с помощью цикла будем проходить по элементам и сравнивать
    c = 0  # вводим счетчик в который добавляем побрякушки
    for i in b:  # проходим по элементам списка b, записывая их в i
        if i in a:  # если значение i есть в списке искомых элементов
            c += 1  # наращиваем счетчик на единицу
    return c  # выводим счётчик с и собственно всё


print(nice_stones_bro())  # а ну и функция - запускаем её