# Сложность алгоритма O(log(n)
def Coach(w):  # создаём функцию
    round = 0  # создаём счётчик матчей
    while w != 1:  # цикл который будет работать пока количество n не будет равно 1
        if w % 2 == 0:  # проверяем делиться ли количество матчей на 2
            round += w / 2  # добавляем количество матчей делённое на два в счётчик
            w = w / 2  # присваиваем n значение делённое на два
        if w % 2 != 0:  # проверяем не делиться ли кол-во матчей
            round += (w - 1) / 2  # добавляем в счётчик количество матчей так, как сказано в условии
            w = (w - 1) / 2 + 1  # присваиваем n значение которое сказано в условии
    return int(round)  # выводим и округляем при помощи инта


print(Coach(14))  # соответственно запускаем функцию
