# сложность алгоритма меньше чем O(n), т.к мы проходимся по циклу меньше чем n раз

def Count(w):# создаём функцию
    i = 0  # создаём счетчик, который будет считать кол-во действий над числом
    while w != 0:  # цикл while, который будет работать, пока число не станет равным нулю
        if w % 2 == 0:  # условия проверяющее делится ли число на 2
            w = w/ 2  # делим число на 2, по условию задачи
            i += 1  # увеличиваем значение в счётчике на единицу
        if w % 2 != 0:  # условие проверяющее не делится ли число на 2
            w = w - 1  # вычитаем единицу, по условию  задачи
            i += 1  # увеличиваем значение счетчика на единицу
    return i


print(Count(14))