# Сложность алгоритма O(log(n)
def F(n):  # создаём функцию
    mathes = 0  # создаём счётчик матчей
    while n != 1:  # цикл который будет работать пока количество n не будет равно 1
        if n % 2 == 0:  # проверяем делиться ли количество матчей на 2
            mathes += n / 2  # добавляем количество матчей делённое на два в счётчик
            n = n / 2  # присваиваем n значение делённое на два
        if n % 2 != 0:  # проверяем не делиться ли кол-во матчей
            mathes += (n - 1) / 2  # добавляем в счётчик количество матчей так, как сказано в условии
            n = (n - 1) / 2 + 1  # присваиваем n значение которое сказано в условии
    return int(mathes)  # выводим и округляем при помощи инта


print(F(14))  # соответственно запускаем функцию
